{
  "users": [
    {
      "id": "1",
      "nama": "octa",
      "email": "adiputraoctavan@gmail.com",
      "password": "123456",
      "confirmPassword": "123456"
    },
    {
      "id": "ed0e",
      "nama": "Epsa",
      "email": "epsa@gmail.com",
      "password": "qwerty",
      "confirmPassword": "qwerty",
      "deskripsi": "Saya adalah enigmanians \n"
    }
  ],
  "notes": [
    {
      "userId": "1",
      "categoryId": "3",
      "title": "Mengenal Framework dalam Pengembangan Aplikasi dan Program",
      "description": "Apa Itu Framework?\n\nFramework adalah sebuah kumpulan kode yang dapat digunakan untuk membantu pengembangan aplikasi atau program. Framework ini menyediakan beberapa fitur yang dapat digunakan oleh pengembang untuk mempermudah dan mempercepat proses pengembangan. Framework dapat berupa software atau library yang dapat digunakan untuk membangun aplikasi atau program dengan cara yang lebih efisien dan efektif.\n\nFramework dapat beragam, mulai dari framework untuk pengembangan aplikasi web, mobile, hingga aplikasi desktop. Beberapa contoh framework yang populer diantaranya:\n\nDjango: Framework Python untuk pengembangan aplikasi web.\nRuby on Rails: Framework Ruby untuk pengembangan aplikasi web.\nAngularJS: Framework JavaScript untuk pengembangan aplikasi web.\nReact Native: Framework untuk pengembangan aplikasi mobile.\nFlutter: Framework untuk pengembangan aplikasi mobile dan web.\nFramework ini dapat mempermudah proses pengembangan, mengurangi kode duplikat, dan memastikan konsistensi kode. Framework juga dapat menyediakan beberapa fitur yang dapat digunakan secara langsung, seperti autentikasi, routing, dan database. Pengembang dapat menggunakan framework yang sesuai dengan teknologi yang digunakan dalam proyeknya. Pilihan framework yang tepat akan mempermudah proses pengembangan dan memastikan kualitas kode yang tinggi.\n\nJadi, Framework adalah sebuah kumpulan kode yang dapat digunakan untuk membantu pengembangan aplikasi atau program. Framework ini dapat mempermudah proses pengembangan, mengurangi kode duplikat, dan memastikan konsistensi kode. Pengembang dapat menggunakan framework yang sesuai dengan teknologi yang digunakan dalam proyeknya. Pilihan framework yang tepat akan mempermudah proses pengembangan dan memastikan kualitas kode yang tinggi.\n\nFramework juga dapat dipelajari melalui jurusan rekayasa perangkat lunak, salah satu perguruan tinggi yang menyediakan jurusan ini adalah Telkom University Surabaya. Jurusan rekayasa perangkat lunak di Telkom University Surabaya mempelajari:\n\nArtificial Intelligence\nAnimation and 3D Modelling\nMobile Programming\nWeb Programming\nGame Programming",
      "images": [
        {
          "data_url": "http://localhost:5173/uploads/1723716885774.jpg"
        }
      ],
      "timestamp": 1723716885801,
      "id": "b42f"
    },
    {
      "id": "6caf",
      "userId": "1",
      "categoryId": "2",
      "title": "Contoh Soal dari Teorema Dasar Kalkulus II",
      "description": "Teorema Dasar Kalkulus ??? Apa sih itu ?\n\nDulu, untuk menyelesaikan persamaan integral tentu orang-orang menggunakan sebuah cara yang disebut dengan Jumlah Riemann. Setelah bertahun – tahun kemudian, para ilmuwan seperti Newton dan Leibniz mengaji lebih dalam mengenai kemiringan garis singgung dan luas daerah kurva. Mereka memahami dan memanfaatkan hubungan antara anti-turunan dengan integral tentu. Hubungan inilah yang disebut dengan Teorema Dasar Kalkulus Pertama.\n\nTeorema dasar kalkulus menjelaskan tentang hubungan antara dua operasi pusat kalkulus , yaitu diferensiasi dan integrasi. Sesungguhnya diferensiasi dengan integrasi merupakan dua opeasi inverse seperti penjumlahan dengan pengurangan atau pembagian dengan perkalian. Teorema Dasar Kalkulus digunakan untuk membantu menyelesaikan proses pengintegralan suatu fungsi. Teorema dasar kalkulus ada dua, pertama disebut dengan Teorema Dasar Kalkulus I dan yang kedua disebut dengan Teorema Dasar Kalkulus II.dan sekrang aku share contoh soal dari Teorema Dasar Kalkulus II",
      "images": [
        {
          "data_url": "http://localhost:5173/uploads/1723711752094.jpg"
        },
        {
          "data_url": "http://localhost:5173/uploads/1723711752096.jpg"
        }
      ],
      "timestamp": 1723711752124
    },
    {
      "id": "0d3c",
      "userId": "ed0e",
      "categoryId": "4",
      "title": "Teknologi Informasi",
      "description": "Penjelasan Mengenai Dasar-Dasar Teknologi Informasi",
      "images": [
        {
          "data_url": "http://localhost:5173/uploads/1723718016811.jpg"
        },
        {
          "data_url": "http://localhost:5173/uploads/1723718016813.jpg"
        },
        {
          "data_url": "http://localhost:5173/uploads/1723718016820.jpg"
        }
      ],
      "timestamp": 1723718016828
    }
  ],
  "categories": [
    {
      "id": "1",
      "name": "Ilmu Pengetahuan Alam",
      "img": "https://img.freepik.com/free-vector/flat-biotechnology-concept_23-2148906613.jpg?t=st=1723190354~exp=1723193954~hmac=419f70ee84e7ef9542dbacb747cf827f60c6e654f912bc592d4cfb883d618a1c&w=740"
    },
    {
      "id": "2",
      "name": "Matematika",
      "img": "https://img.freepik.com/free-vector/isometric-maths-material-background_23-2148148447.jpg?t=st=1723190838~exp=1723194438~hmac=78da4f2aceb07509c7fdb07a6070fad1ed3438401c3272e748727f8885bbbde1&w=740"
    },
    {
      "id": "3",
      "name": "Teknik",
      "img": "https://img.freepik.com/free-vector/engineering-background-design_1300-11.jpg?t=st=1723192552~exp=1723196152~hmac=21f4bd16e37e935ef3f7ba32a84020ea64579a5ef75a62b6fda0e48daf69e86a&w=740"
    },
    {
      "id": "4",
      "name": "Komputer & Teknologi Informasi",
      "img": "https://img.freepik.com/free-vector/construction-background-design_1283-9.jpg?t=st=1723192472~exp=1723196072~hmac=b10ba3e42e8cff355ce577218b001759819c4fc841f4d4bc960bcb9dc232fe25&w=740"
    },
    {
      "id": "5",
      "name": "Ilmu Kesehatan",
      "img": "https://img.freepik.com/free-vector/science-concept-with-microscope_23-2148539650.jpg?t=st=1723192740~exp=1723196340~hmac=4285f2c32cf4254aa650e87451fe308fd42c2e6f9a2e586e8d8846bd890f4938&w=740"
    }
  ]
}